<?php

/*
|----------------------------------------------------------------------
| --------------- Translate all keywords in Admin Panel ---------------
|----------------------------------------------------------------------
*/

return [
   'server_side' => 'حدث خطأ ما',

   'yes' => 'نعم',
   'no' => 'لا',
   'back_dashboard' => 'عودة إلى لوحة التحكم',
   'Forbidden' => 'عذراً ، ليس لديك الصلاحيات',


   // ---------- Errors ----------
   '403_error' => 'عذراً ، ليس لديك الصلاحيات',
   '404_error' => 'الصفحة غير موجودة',
   '500_error' => 'خطأ في الخادم',

   // ---------- Permission ----------

   'inviteds' => 'إرسال الدعوات',
   'employees' => 'الموظفين',
   'days' => 'الفعاليات',
   'qrcode' => 'qrcode',
   'places' => 'المناطق',
   'dashboard' => 'الاطلاع على الداشبورد',
   'conf' => 'الاعدادات',
   'change-history' => 'الاطلاع على سجل التغييرات',
   'first-surname' => 'الألقاب 1',
   'second-surname' => 'الألقاب 2',
   'categories' => 'الفئات',
   // ---------- Datatable ----------
   "loadingRecords"=> "جارٍ التحميل...",
   "lengthMenu"=> "أظهر _MENU_ مدخلات",
   "zeroRecords"=> "لم يعثر على أية سجلات",
   "info"=> "إظهار _START_ إلى _END_ من أصل _TOTAL_ مدخل",
   "search"=> "ابحث:",
   "processing"=> "جارٍ المعالجة...",
   "emptyTable"=> "لا يوجد بيانات متاحة في الجدول",
   "infoEmpty"=> "يعرض 0 إلى 0 من أصل 0 مُدخل",
   "thousands"=> ".",
   "decimal"=> ",",
   "infoFiltered"=> "(مرشحة من مجموع _MAX_ مُدخل)",
   "previous"=> "السابق",
   "next"=> "التالي",
   "sortAscending"=> ": تفعيل لترتيب العمود تصاعدياً",
   "sortDescending"=> ": تفعيل لترتيب العمود تنازلياً",
   "first" => "الأول",
   "last" => "الأخير",
];
